class A:
    def __init__(self):
        self.test = 33
    def getTest(self):
        return self.test


if __name__ == '__main__':
    checkKeys = [
        {'支持水印1': ' ', '音频录制': ' ', '支持平台': ' ', '下载链接': ' ', '免费/收费': ' ', '产品名': ' ', '摄像头桌面组合录制': ' ', '鼠标特效': ' ', '画质调整': ' ', '区域录制': ' ', '产品描述': ' '},
        {'支持水印2': ' ', '音频录制': ' ', '支持平台': ' ', '下载链接': ' ', '免费/收费': ' ', '产品名': ' ', '摄像头桌面组合录制': ' ', '鼠标特效': ' ', '画质调整': ' ', '区域录制': ' ', '产品描述': ' '},
        {'支持水印3': ' ', '音频录制': ' ', '支持平台': ' ', '下载链接': ' ', '免费/收费': ' ', '产品名': ' ', '摄像头桌面组合录制': ' ', '鼠标特效': ' ', '画质调整': ' ', '区域录制': ' ', '产品描述': ' '},
        {'支持水印4': ' ', '音频录制': ' ', '支持平台': ' ', '下载链接': ' ', '免费/收费': ' ', '产品名': ' ', '摄像头桌面组合录制': ' ', '鼠标特效': ' ', '画质调整': ' ', '区域录制': ' ', '产品描述': ' '}
    ]

    checkKeys[0]['支持水印1'] = ' 撒大概 第三方1245fdf'
    for item in checkKeys:
        print(item)